<?php

return [
    'create' => 'Δημιουργήστε μία εγγραφή',
    'button' => [
        'add' => 'Προσθήκη εγγραφής',
        'save' => 'Αποθήκευση αλλαγών',
    ],
    'label' => [
        'number' => 'Αριθμός:',
        'subject' => 'Μάθημα:',
        'unit' => 'Ενότητα:',
        'statement' => 'Εκφώνηση:',
        'solution' => 'Επίλυση:',
        'locale' => 'Γλώσσα:',
    ],
    'placeholder' => [
        'statement' => 'Εκφώνηση',
        'solution' => 'Επίλυση',
        'subject' => 'Επιλέξτε ένα μάθημα',
    ],
    'error' => [
        'subject' => 'Παρακαλώ επιλέξτε ένα μάθημα',
        'image' => 'Επιτρέπονται μόνο εικόνες PNG και JPG.',
        'statement' => 'Εκφώνηση: Παρακαλώ εισάγετε κείμενο ή ανεβάστε μία εικόνα.',
        'solution' => 'Επίλυση: Παρακαλώ εισάγετε κείμενο ή ανεβάστε μία εικόνα.',
        'number' => 'O αριθμός της εγγραφής δεν μπορεί να είναι πάνω από 500.',
        'unique' => 'Υπάρχει ήδη εγγραφή με αυτό το μάθημα και ενότητα.',
    ],
    'confirm' => 'Θέλετε να διαγράψετε αυτήν την εγγραφή;',
];
